SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Bootloader/Device/MM32L0020/Source/KEIL_StartAsm/startup_mm32l0020_keil.s
;/***********************************************************************************************************************
;    @file     startup_mm32l0020_keil.s
;    @author   VV TEAM
;    @brief    THIS FILE PROVIDES ALL THE Device Startup File of MM32 Cortex-M
;              Core Device for ARM KEIL toolchain.
;  **********************************************************************************************************************
;    @attention
;
;    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>
;
;      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
;    following conditions are met:
;    1. Redistributions of source code must retain the above copyright notice,
;       this list of conditions and the following disclaimer.
;    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
;       the following disclaimer in the documentation and/or other materials provided with the distribution.
;    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
;       promote products derived from this software without specific prior written permission.
;
;      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
;    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
;    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
;    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
;    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
;    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
;    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
;  *********************************************************************************************************************/


Stack_Size      EQU     0x00000200

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Heap_Size       EQU     0x00000000

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp                                            ;    Top of Stack
                DCD     Reset_Handler                                           ;    Reset Handler
                DCD     NMI_Handler                                             ;    NMI Handler
                DCD     HardFault_Handler                                       ;    Hard Fault Handler
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     SVC_Handler                                             ;    SVCall Handler
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     PendSV_Handler                                          ;    PendSV Handler
                DCD     SysTick_Handler                                         ;    SysTick Handler

                ; External Interrupts
                DCD     WWDG_IWDG_IRQHandler                                    ;    WWDG_IWDG thru EXTI21
                DCD     PVD_IRQHandler                                          ;    PVD through EXTI 16
                DCD     0                                                       ;    Reserved
                DCD     FLASH_IRQHandler                                        ;    FLASH
                DCD     RCC_IRQHandler                                          ;    RCC
                DCD     EXTI0_1_IRQHandler                                      ;    EXTI Line 0 and 1
                DCD     EXTI2_3_IRQHandler                                      ;    EXTI Line 2 and 3
                DCD     EXTI4_15_IRQHandler                                     ;    EXTI Line 4 to 15
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     ADC_COMP_IRQHandler                                     ;    ADC_COMP
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     TIM3_IRQHandler                                         ;    TIM3
                DCD     LPUART_IRQHandler                                       ;    LPUART
                DCD     LPTIMER_IRQHandler                                      ;    LPTIMER
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     TIM16_IRQHandler                                        ;    TIM16
                DCD     TIM17_IRQHandler                                        ;    TIM17
                DCD     I2C1_IRQHandler                                         ;    I2C1
                DCD     0                                                       ;    Reserved
                DCD     SPI1_IRQHandler                                         ;    SPI1
                DCD     0                                                       ;    Reserved
                DCD     UART1_IRQHandler                                        ;    UART1
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved
                DCD     0                                                       ;    Reserved

                                                                                ; Total Cortex-M0 32 Interrupts are setting
__Vectors_End
__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

; Reset handler
Reset_Handler   PROC
                EXPORT  Reset_Handler                  [WEAK]
                IMPORT  __main
                IMPORT  SystemInit


                LDR     R0, =__initial_sp                                       ; set stack pointer
                MSR     MSP, R0

ApplicationStart
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                    [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler              [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                    [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler                 [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler                [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT  WWDG_IWDG_IRQHandler           [WEAK]
                EXPORT  PVD_IRQHandler                 [WEAK]
                EXPORT  FLASH_IRQHandler               [WEAK]
                EXPORT  RCC_IRQHandler                 [WEAK]
                EXPORT  EXTI0_1_IRQHandler             [WEAK]
                EXPORT  EXTI2_3_IRQHandler             [WEAK]
                EXPORT  EXTI4_15_IRQHandler            [WEAK]
                EXPORT  ADC_COMP_IRQHandler            [WEAK]
                EXPORT  TIM3_IRQHandler                [WEAK]
                EXPORT  LPUART_IRQHandler              [WEAK]
                EXPORT  LPTIMER_IRQHandler             [WEAK]
                EXPORT  TIM16_IRQHandler               [WEAK]
                EXPORT  TIM17_IRQHandler               [WEAK]
                EXPORT  I2C1_IRQHandler                [WEAK]
                EXPORT  SPI1_IRQHandler                [WEAK]
                EXPORT  UART1_IRQHandler               [WEAK]


WWDG_IWDG_IRQHandler
PVD_IRQHandler
FLASH_IRQHandler
RCC_IRQHandler
EXTI0_1_IRQHandler
EXTI2_3_IRQHandler
EXTI4_15_IRQHandler
ADC_COMP_IRQHandler
TIM3_IRQHandler
LPUART_IRQHandler
LPTIMER_IRQHandler
TIM16_IRQHandler
TIM17_IRQHandler
I2C1_IRQHandler
SPI1_IRQHandler
UART1_IRQHandler


                B       .

                ENDP

                ALIGN

;*******************************************************************************
; User Stack and Heap initialization
;*******************************************************************************
                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap

                LDR     R0, = Heap_Mem
                LDR     R1, = (Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF
                END
